Repository: YusufCakan/mselang
Catalog: src/languages/testing/mselang/mselang_context_*.po
Languages: fr

# patheditfo,hint
source: Right-click to add row, (like -Fu/home/theproj or -othedefine)
fr: Clic droit de souris pour ajouter une rangée (exemple -Fu/home/projet ou -dunedefinition)

# patheditfo,caption
source: Units Path and Define Editor
fr: Éditeur de Chemin et Définition

# patheditfo,twidgetgrid1,frame.caption
source: Compiler parameters
fr: Paramètres du compilateur

# patheditfo,tbutton2,caption
source: Cancel
fr: Annuler

# patheditfo,tbutton3,caption
source: Add row
fr: Ajouter une rangée

# patheditfo,tbutton4,caption
source: Del row
fr: Détruire la rangée.

# mainfo,tgroupbox1,frame.caption
source: MSElang parameters
fr: Paramètres de MSElang

# mainfo,tgroupbox1,nameed,frame.caption
source: name info
fr: Info nom

# mainfo,tgroupbox1,nameed,hint
source: debug name info
fr: Debug nom info

# mainfo,tgroupbox1,builded,frame.caption
source: build
fr: Construire

# mainfo,tgroupbox1,builded,hint
source: Build all
fr: Construire tout

# mainfo,tgroupbox1,nortlunitsed,frame.caption
source: no rtl
fr: Pas de rtl

# mainfo,tgroupbox1,nortlunitsed,hint
source: Do not use rtl units
fr: Ne pas utiliser les unités rtl

# mainfo,tgroupbox1,nocompilerunited,frame.caption
source: no comp
fr: Pas de comp

# mainfo,tgroupbox1,nocompilerunited,hint
source: Do not use compilers units
fr: Ne pas utiliser les unités de compilateur

# mainfo,tgroupbox1,objed,frame.caption
source: object
fr: Objet

# mainfo,tgroupbox1,objed,hint
source: Create object files
fr: Créer des fichiers objet

# mainfo,tgroupbox1,modulared,frame.caption
source: modular
fr: Modulaire

# mainfo,tgroupbox1,modulared,hint
source: Modular compilation
fr: Compilation modulaire

# mainfo,tgroupbox1,lineinfoed,frame.caption
source: line info
fr: Info de ligne

# mainfo,tgroupbox1,lineinfoed,hint
source: debug line info
fr: Debug info ligne

# mainfo,tgroupbox1,keeptmped,frame.caption
source: keep temp
fr: Garder fichiers temporaires

# mainfo,tgroupbox1,keeptmped,hint
source: Keep temp files after compilation
fr: Garder fichiers temporaires après compilation

# mainfo,tgroupbox1,btnPath,hint
source: Units used (-Fu...) and Defines (-d...)
fr: Unités utilisées (-Fu...) et définition (-d...)

# mainfo,tgroupbox1,proginfoed,frame.caption
source: prog info
fr: Info du programme.

# mainfo,tgroupbox1,proginfoed,hint
source: debug program info
fr: Debug Info du programme.

# mainfo,tgroupbox2,frame.caption
source: Linking
fr: Lier

# mainfo,tgroupbox2,gcced,hint
source: Extra options for gcc
fr: Options extra pour gcc

# mainfo,tgroupbox2,begcc,hint
source: Execute gcc to link assembler code from llc
fr: Exécuter gcc pour lier le code assembler issu de llc

# mainfo,tgroupbox2,llced,hint
source: extra options for llvm-llc
fr: Options extra pour llvm-llc

# mainfo,tgroupbox2,bellc,hint
source: Execute llc to produce assembler code
fr: Exécuter llc pour produire code assembler

# mainfo,tgroupbox2,linked,hint
source: Extra options for llvm-link
fr: Options extra pour llvm-link

# mainfo,tgroupbox2,belink,hint
source: Execute llvm-link
fr: Exécuter llvm-link

# mainfo,tgroupbox2,clanged,hint
source: Extra options for Clang
fr: Options extra pour clang

# mainfo,tgroupbox2,beclang,hint
source: Execute Clang linking
fr: Exécuter clang

# mainfo,tgroupbox3,frame.caption
source: Optimization
fr: Optimisation

# mainfo,tgroupbox3,beopt,hint
source: Execute opt
fr: Exécuter opt

# mainfo,tgroupbox3,opted,hint
source: Extra options for llvm-opt
fr: Options extra pour llvm-opt

# mainfo,tgroupbox4,frame.caption
source: Input / Output
fr: Entrée / Sortie

# mainfo,tgroupbox4,edexeex,hint
source: File extension of the output executable
fr: Extension de fichier de l'exécutable.

# mainfo,tgroupbox4,edexena,frame.caption
source: Output exec name
fr: Nom de l'exécutable

# mainfo,tgroupbox4,edexena,hint
source: File name of the output executable. If empty Pascal filename will be used.
fr: Nom du fichier de l'exécutable en sortie. Si le fichier est vide, le nom du fichier Pascal sera utilisé.

# mainfo,tgroupbox4,extcomp,hint
source: If enabled use external compiler mlc else use built-in mselang parser.
fr: Si cette option est activée, utilisez le compilateur externe mlc. Sinon, utilisez l'analyseur mselang intégré.

# mainfo,tgroupbox4,runend,frame.caption
source: Run at end
fr: Exécuter à la fin

# mainfo,tgroupbox4,runend,hint
source: Run the application at end
fr: Exécuter l'application à la fin

# mainfo,tgroupbox4,llvm,hint
source: If enabled produce a bc file (bitcode) else a mli file (for interpreter)
fr: Si activé, produit un fichier bc (bitcode) sinon un fichier mli (pour l'interpréteur)

# mainfo,tgroupbox4,llvmbindir,frame.caption
source: Directory of llvm binaries
fr: Répertoire des binaires LLVM

# mainfo,tgroupbox4,llvmbindir,hint
source: Directory of LLVM suite
fr: Répertoire de la suite LLVM

# mainfo,tgroupbox4,llvmbindir,controller.filterlist.data,0:,0:
source: MSElang source
fr: Source MSElang

# mainfo,tgroupbox4,filena,frame.caption
source: Input filename
fr: Fichier d'entrée

# mainfo,tgroupbox4,filena,hint
source: Pascal main filename used as input.
fr: Nom de fichier principal Pascal utilisé comme entrée.

# mainfo,tgroupbox4,filena,controller.filterlist.data,0:,0:
source: All Pascal source
fr: Toutes Pascal sources

# mainfo,tgroupbox4,filena,controller.filterlist.data,1:,0:
source: MSElang source
fr: Source MSElang

# mainfo,tgroupbox4,filena,controller.filterlist.data,4:,0:
source: All
fr: Tout

# mainfo,tgroupbox4,filena,controller.captionopen
source: Open a Pascal source file
fr: Ouvrir un fichier source Pascal

# mainfo,tgroupbox4,btnload,hint
source: Reload Pascal file
fr: Recharger le fichier Pascal

# mainfo,tgroupbox4,btnload,caption
source: Reload
fr: Recharger

# mainfo,tgroupbox4,tbutton2,hint
source: Parse and build all
fr: Analyser et construire tout

# mainfo,tgroupbox4,tbutton2,caption
source: Parse
fr: Analy

# mainfo,tgroupbox4,tbutton3,hint
source: Run the executable (if created)
fr: Exécuter l'exécutable (si créé)

# mainfo,tgroupbox4,tbutton3,caption
source: Run
fr: Exéc

# mainfo,tgroupbox4,tbutton4,hint
source: Interpret the mli file (if created)
fr: Interpréter le fichier mli (si créé)

# mainfo,tgroupbox4,workpan,value
source: Working...
fr: Au travail...

# mainfo,tgroupbox4,tbutton5,hint
source: Save Pascal file
fr: Enregistrer le fichier Pascal

# mainfo,tgroupbox4,tbutton5,caption
source: Save
fr: Enreg

# mainfo,coldi,text
source: Col: 0 Row: 0
fr: Col: 0 Ran: 0
