Repository: YusufCakan/mselang
Catalog: src/lang/po_files/mselang_context_*.po
Languages: ru

# patheditfo,hint
source: Right-click to add row, (like -Fu/home/theproj or -othedefine)
ru: Щёлкните правой кнопкой мыши, чтобы добавить строку (например, -Fu/home/theproj или -othedefine)

# patheditfo,caption
source: Units Path and Define Editor
ru: Путь модулей и редактора определений

# patheditfo,twidgetgrid1,frame.caption
source: Compiler parameters
ru: Параметры компиляции

# patheditfo,tbutton1,caption
source: OK
ru: ОК

# patheditfo,tbutton2,caption
source: Cancel
ru: Отмена

# patheditfo,tbutton3,caption
source: Add row
ru: Добавить строку

# patheditfo,tbutton4,caption
source: Del row
ru: Удалить строку

# mainfo,tgroupbox1,frame.caption
source: MSElang parameters
ru: Параметры MSElang

# mainfo,tgroupbox1,nameed,frame.caption
source: name info
ru: имя инфо

# mainfo,tgroupbox1,nameed,hint
source: debug name info
ru: отладка имя инфо

# mainfo,tgroupbox1,builded,frame.caption
source: build
ru: пересобрать

# mainfo,tgroupbox1,builded,hint
source: Build all
ru: Пересобрать все

# mainfo,tgroupbox1,nortlunitsed,frame.caption
source: no rtl
ru: без rtl

# mainfo,tgroupbox1,nortlunitsed,hint
source: Do not use rtl units
ru: Не использовать модули rtl

# mainfo,tgroupbox1,nocompilerunited,frame.caption
source: no comp
ru: без компилятора

# mainfo,tgroupbox1,nocompilerunited,hint
source: Do not use compilers units
ru: Не использовать модули компилятора

# mainfo,tgroupbox1,objed,frame.caption
source: object
ru: объект

# mainfo,tgroupbox1,objed,hint
source: Create object files
ru: Создать объектные файлы

# mainfo,tgroupbox1,modulared,frame.caption
source: modular
ru: модульная

# mainfo,tgroupbox1,modulared,hint
source: Modular compilation
ru: Модульная компиляция

# mainfo,tgroupbox1,lineinfoed,frame.caption
source: line info
ru: строка инфо

# mainfo,tgroupbox1,lineinfoed,hint
source: debug line info
ru: отладка строка инфо

# mainfo,tgroupbox1,keeptmped,frame.caption
source: keep temp
ru: сохранить временные

# mainfo,tgroupbox1,keeptmped,hint
source: Keep temp files after compilation
ru: Сохранить временные файлы после компиляции

# mainfo,tgroupbox1,btnPath,hint
source: Units used (-Fu...) and Defines (-d...)
ru: Используемые модули (-Fu...) и определения (-d...)

# mainfo,tgroupbox1,btnPath,caption
source: Para
ru: Пара

# mainfo,tgroupbox1,proginfoed,frame.caption
source: prog info
ru: прог инфо

# mainfo,tgroupbox1,proginfoed,hint
source: debug program info
ru: отладка программа инфо

# mainfo,tgroupbox2,frame.caption
source: Linking
ru: Линковка

# mainfo,tgroupbox2,gcced,hint
source: Extra options for gcc
ru: Экстра опции для gcc

# mainfo,tgroupbox2,begcc,hint
source: Execute gcc to link assembler code from llc
ru: Выполнить gcc, чтобы связать ассемблерный код с llc

# mainfo,tgroupbox2,llced,hint
source: extra options for llvm-llc
ru: Экстра опции для llvm-llc

# mainfo,tgroupbox2,bellc,hint
source: Execute llc to produce assembler code
ru: Выполнить llc для создания ассемблерного кода

# mainfo,tgroupbox2,linked,hint
source: Extra options for llvm-link
ru: Экстра опции для llvm-link

# mainfo,tgroupbox2,belink,hint
source: Execute llvm-link
ru: Выполнить llvm-link

# mainfo,tgroupbox2,clanged,hint
source: Extra options for Clang
ru: Экстра опции для Clang

# mainfo,tgroupbox2,beclang,hint
source: Execute Clang linking
ru: Выполнить линковку Clang

# mainfo,tgroupbox3,frame.caption
source: Optimization
ru: Оптимизация

# mainfo,tgroupbox3,beopt,hint
source: Execute opt
ru: Выполнить оптим.

# mainfo,tgroupbox3,opted,hint
source: Extra options for llvm-opt
ru: Экстра опции для llvm-opt

# mainfo,tgroupbox4,frame.caption
source: Input / Output
ru: Ввод/Вывод

# mainfo,tgroupbox4,edexeex,frame.caption
source: Ext
ru: Расш.

# mainfo,tgroupbox4,edexeex,hint
source: File extension of the output executable
ru: Расширение файла выходного исполняемого файла

# mainfo,tgroupbox4,edexena,frame.caption
source: Output exec name
ru: Выходное имя бинарника

# mainfo,tgroupbox4,edexena,hint
source: File name of the output executable. If empty Pascal filename will be used.
ru: Имя файла выходного исполняемого файла. Если пустое, то имя файла Pascal будет использоваться.

# mainfo,tgroupbox4,extcomp,frame.caption
source: Ext Comp
ru: Расш. комп.

# mainfo,tgroupbox4,extcomp,hint
source: If enabled use external compiler mlc else use built-in mselang parser.
ru: Если включено, то используется внешний компилятор mlc, иначе используйте встроенный парсер mselang.

# mainfo,tgroupbox4,runend,frame.caption
source: Run at end
ru: Запустить в конце

# mainfo,tgroupbox4,runend,hint
source: Run the application at end
ru: Запустите приложение в конце

# mainfo,tgroupbox4,llvm,hint
source: If enabled produce a bc file (bitcode) else a mli file (for interpreter)
ru: Если включено, то создать bc-файл (битовый код), иначе mli-файл (для интерпретатора)

# mainfo,tgroupbox4,llvmbindir,frame.caption
source: Directory of llvm binaries
ru: Директория бинарных файлов llvm

# mainfo,tgroupbox4,llvmbindir,hint
source: Directory of LLVM suite
ru: Директория набора LLVM

# mainfo,tgroupbox4,llvmbindir,controller.filterlist.data,0:,0:
source: MSElang source
ru: Исходник MSElang

# mainfo,tgroupbox4,filena,frame.caption
source: Input filename
ru: Имя файла ввода

# mainfo,tgroupbox4,filena,hint
source: Pascal main filename used as input.
ru: Главное имя файла Pascal, используемого как ввод.

# mainfo,tgroupbox4,filena,controller.filterlist.data,0:,0:
source: All Pascal source
ru: Все исходники Pascal

# mainfo,tgroupbox4,filena,controller.filterlist.data,1:,0:
source: MSElang source
ru: Исходник MSElang

# mainfo,tgroupbox4,filena,controller.filterlist.data,4:,0:
source: All
ru: Все

# mainfo,tgroupbox4,filena,controller.captionopen
source: Open a Pascal source file
ru: Открыть исходный файл Pascal

# mainfo,tgroupbox4,btnload,hint
source: Reload Pascal file
ru: Перезагрузить файл Pascal

# mainfo,tgroupbox4,btnload,caption
source: Reload
ru: Перезагрузить

# mainfo,tgroupbox4,tbutton2,hint
source: Parse and build all
ru: Парсить и пересобрать все

# mainfo,tgroupbox4,tbutton2,caption
source: Parse
ru: Парсить

# mainfo,tgroupbox4,tbutton3,hint
source: Run the executable (if created)
ru: Запустить исполняемый файл (если создан)

# mainfo,tgroupbox4,tbutton3,caption
source: Run
ru: Запустить

# mainfo,tgroupbox4,tbutton4,hint
source: Interpret the mli file (if created)
ru: Интерпретировать mli-файл (если создан)

# mainfo,tgroupbox4,tbutton4,caption
source: Inter
ru: Интерпр.

# mainfo,tgroupbox4,workpan,value
source: Working...
ru: За работой...

# mainfo,tgroupbox4,tbutton5,hint
source: Save Pascal file
ru: Сохранить файл Pascal

# mainfo,tgroupbox4,tbutton5,caption
source: Save
ru: Сохранить

# mainfo,coldi,text
source: Col: 0 Row: 0
ru: Кол: 0 Стр: 0
